Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/employment/employment_rights_and_conditions/contracts_of_employment/contract_of_employment.html.txt.tmx
Source language: en
Languages: ga

source: Anyone who works for an employer for a regular wage or salary automatically has a contract of employment
ga: Tá conradh fostaíochta ag duine nuair atá sé/sí ag obair d'fhostóir ar phá nó tuarastal rialta

source: While the complete contract does not have to be in writing, an employee must be given a written statement of terms of employment within 2 months of starting work - see 'Rules' below
ga: Cé nach gcaithfidh an t-iomlán conradh bheith scríofa, is gá ráiteas scríofa téarmaí fhostaíochta don fhostaí a thabhairt laistigh 2 mhí thosú oibre - féach 'Rialacha' thíos

source: The majority of employees work under open-ended contracts of employment
ga: Oibríonn formhór fhostaithe ar chonarthaí oibre neamhiata

source: In other words, the contract continues until such time as the employer or employee ends it
ga: Sé sin, maireann an conradh go dtí go gcuireann an fostóir nó an fostaí deireadh leis

source: Many other employees however, work under fixed-term or specified-purpose contracts which are contracts which end on a specified date or when a specific task is completed
ga: Ciallaíonn an téarma, conarthaí ar théarma seasta nó sainchuspóra, go gcríochnaíonn conradh an fhostaí ar dháta áirithe, nó go gcríochnaíonn sé nuair atá tasc áirithe déanta

source: The contract of employment will include some or all of the following elements (regardless of whether the employer and employee have specified them or not):
ga: Beidh na nithe seo a leanas nó cuid de na nithe sa chonradh (is cuma má tá siad luaite nó nach bhfuil siad luaite ag an bhfostóir agus ag an bhfostaí):

source: • The terms that the courts say are in every contract of employment
ga: • Na téarmaí atá leagtha síos ag an gcúirt do gach conradh fostaíochta

source: Examples include the duty of every employer to provide a safe workplace and the duty of every employee to carry out the job to the best of his/her ability
ga: Na samplaí atá san áireamh ná an dualgas atá ar gach fhostóir, áit oibre sábhailte a sholáthar agus an dualgas atá ar gach fostaí a phost a chomhlíonadh de réir an chumais is fearr atá aige/aici

source: This part of the contract is occasionally referred to as "common law"
ga: Tugtar an " Dlí Comhchoiteann " go hiondúil ar an dlí seo

source: • Terms that must be part of the contract as a result of laws passed by the Dail
ga: • Téarmaí nach mór a bheith mar pháirt den chonradh de bharr reachtaíochta atá rithe tríd an Dáil

source: Examples include the right to take maternity leave
ga: San áireamh tá an ceart saoire máithreachais a thógáil

source: Such terms are part of the contract even if the employer and employee do not specifically include them and replace any agreement between the employer and employee not to apply the particular law
ga: Tá na téarmaí seo mar pháirt den chonradh fiú amháin muna luann an fostóir agus an fostaí iad agus tógann siad áit aon chomhaontaithe idir an fhostóir agus an fostaí gan dlí áirithe a chur i bhfeidhm

source: So, the statutory right to take maternity leave overrides any agreement between the employer and employee that the employee will not take maternity leave
ga: Da bharr sin sáraíonn an ceart reachtúil saoire máithreachais a thógáil aon chomhaontú a dhéanann an fostóir leis an fhostaí nach dtógfaidh an fostaí saoire máithreachais

source: • Terms that the Irish Constitution states must be in every contract, for example, the right of an employee to join a trade union
ga: • Na téarmaí atá leagtha síos i mBunreacht na hÉireann nach mór a bheith i ngach conradh, mar shampla, ceart an fhostaí a bheith mar bhall do cheardchumann

source: • Joint Labour Committee Regulations
ga: • Rialacháin an Chomhchoiste Oibreachais

source: In addition, custom and practice in a particular workplace may form part of a contract
ga: San áireamh is féidir le nós agus cleachtadh a bheith mar pháirt den chonradh in áit oibre

source: An example would be a particular level of overtime pay for employees
ga: Sampla de seo ná ráta pá faoi leith ar ragobair do fhostaithe

source: The Terms of Employment (Information) Acts 1994–2014 provide that an employer is obliged to provide an employee with a written statement of terms of employment within the first 2 months of the commencement of employment
ga: Forálann an tAcht um Théarmaí Fostaíochta (Faisnéis) 1994–2014 go gcaithfidh fostóir ráiteas scríofa faoi théarmaí fostaíochta a thabhairt do fhostaí taobh istigh de 2 mhí ó thús na fostaíochta

source: However, this requirement does not apply to an employee who has been employed for less than a month
ga: Áfach, ní bhaineann an riachtanas seo le fostaí atá fostaithe ar feadh níos lú ná mí amháin

source: You can find a sample written statement of terms of employment (pdf) on workplacerelations.ie
ga: Tá sampla ráiteas scríofa faoi théarmaí fostaíochta ar fáil ar workplacerelations.ie

source: The statement of terms must include the following information:
ga: Caithfidh an t-eolas seo a leanas a bheith mar chuid den ráiteas faoi théarmaí:

source: • The full name of employer and employee
ga: • Ainm iomlán an fhostóra agus an fhostaí

source: • The title of job or nature of work
ga: • Teideal an phoist nó an cineál fostaíochta

source: • The date the employment started
ga: • Dáta a thosaigh an fhostaíocht

source: • If the contract is temporary, the expected duration of the contract
ga: • Más conradh fostaíochta sealadach atá i gceist an tréimhse ama atáthar ag súil go mairfidh an conradh

source: • If the contract of employment is for a fixed term, the details
ga: • Más conradh le haghaidh tréimhse seasta atá i gceist, an dáta a bheidh an conradh istigh

source: • Details of rest periods and breaks as required by law
ga: • Sonraí tréimhsí sosa agus sosanna arna éileamh ag an dlí

source: • *The rate of pay or method of calculation of pay
ga: • An ráta pá nó an chaoi a ríomhtar pá

source: • The pay reference period for the purposes of the National Minimum Wage Act 2000
ga: • An tréimhse thagartha pá de réir an Achta um Íosphá Náisiúnta 2000

source: • *That the employee has the right to ask the employer for a written statement of his/her average hourly rate of pay as provided for in the National Minimum Wage Act 2000
ga: • *Go bhfuil an ceart ag an fostaí ráiteas scríofa ar a m(h)eánphá in aghaidh na huaire i dtaobh tréimhse thagartha ar bith a iarraidh ar an bhfostóir mar atá soláthartha san Acht um Íosphá Náisiúnta 2000

source: • *Details of paid leave
ga: • *Téarmaí a bhaineann le saoire íoctha (seachas saoire tinnis)

source: • *Sick pay and pension (if any)
ga: • *Pá breoiteachta agus pinsin

source: • *Period of notice to be given by employer or employee
ga: • *Fógra scoir atá dlite don fhostaí agus a chaithfidh an fostaí a thabhairt

source: • *Details of any collective agreements that may affect the employee’s terms of employment
ga: • *Tagairt do Chomhaontaithe comhchoiteann ar bith a chuireann isteach ar théarmaí fostaíochta an fhostaithe

source: * In the case of these items instead of giving each employee the details in writing, the employer may refer an employee to other documents, for example, a pension scheme booklet or a collective agreement, provided that the employee has easy access to such documents
ga: * I gcás na sonraí seo thuas, d’fhéadfadh an fostóir, mar rogha ar na sonraí ar fad sa ráiteas a sholáthar, úsáid a bhaint as an ráiteas chun an fostaí a chur ar aghaidh chuig cáipéisí áirithe eile a bhfuil na sonraí sin iontu. Ní mór na cáipéisí sin a bheith ar fáil go réasúnta éasca ag an bhfostaí ina f(h)ostaíocht

source: The statement of terms must indicate the reference period being used by the employer for the purposes of the calculation of the employee's entitlements under the National Minimum Wage Act 2000
ga: Ní mór don ráiteas an tréimhse thagartha atá in úsáid ag an bhfostóir chun teidil an fostaithe de réir an Acht um Íosphá Náisiúnta 2000 a ríomh a lua

source: (Under that Act the employer may calculate the employee's minimum wage entitlement over a reference period that is no less than one week and no greater than one month)
ga: (Faoin Acht sin is féidir leis an bhfostóir íosphá an fhostaithe a ríomh thar thréimhse thagartha nach bhfuil níos lú ná seachtain amháin agus níos faide ná mí amháin)

source: While the statement of these terms must be signed and dated by the employer, there is no requirement for the employee to sign it
ga: Cé go gcaithfidh an fostóir an ráiteas faoi théarmaí fostaíochta a shíniú agus a dhátú, ní gá don fhostaí a shíniú

source: The employer must keep a copy during the period of the employee’s employment and for at least a year after it ceases
ga: Ní mór don fhostóir cóip a choinnigh ar feadh tréimhse fhostaíochta an fhostaí agus ar feadh bliain ar a laghad tar éis deireadh na fostaíochta

source: Disciplinary and grievance procedures
ga: Nósanna imeachta araíonachta agus casaoide

source: The Workplace Relations Commission has a Code of Practice: Grievance and Disciplinary Procedures which states that employers should have written grievance and disciplinary procedures and they should give employees copies of these at the start of their employment
ga: D'fhoilisgh an Coimisiún um Chaidreamh san Áit Oibre an Cód Cleachtais: Nósanna Imeachta Casaoide agus Araíonachta a shonraíonn gur chóir nósanna imeachta casaoide agus araíonachta a bheith ag fostóirí agus gur chóir dóibh cóipeanna díobh seo a thabhairt d'fhostaithe ag tús a gcuid fostaíochta

source: Under the Unfair Dismissals Acts 1977–2015 employers are required to give the employee in written notice of the procedures to be followed before an employee is dismissed
ga: Faoi na hAchtanna um Dhífhostú Éagórach 1977-2015 tá dualgas ar fhostóirí fógra scríofa de na nósanna imeachta a leanfar a thabhairt d'fhostaí sula ndíbrítear fostaí óna p(h)ost

source: This must be done within 28 days of entering the contract of employment
ga: Caithfear é seo a dhéanamh laistigh de 28 lá ó chonradh fostaíochta a dhéanamh

source: Specific provisions in contracts of employment
ga: Forálacha sainiúla i gconarthaí fostaíochta

source: In recent times, some employers are adding in specific provisions in contracts of employment that limit the ability of employees to work in a certain sector, with certain suppliers, clients, for a period following termination of employment
ga: Tá roinnt fostóirí ag cur forálacha sainiúla le conarthaí fostaíochta a chuireann srian le cumas fostaithe oibriú in earnálacha nó le soláthraithe faoi leith, nó le cliaint áirithe ar feadh tréimhse ó chuirtear deireadh lena bhfostaíocht

source: (For example, it may specifically state that the employee cannot work in a certain sector, with or for suppliers or clients of the former employer.) There is nothing in employment law that strictly forbids this, but there is no provision in employment law that allows this either
ga: (D'fhéadfadh sé a rá mar shampla nach bhféadfadh an fostaí oibriú in earnáil faoi leith, nó le soláthraithe nó le cliaint an iarfhostóra, srl.) Níl aon rud i ndlí fostaíochta a choisceann é seo ach níl aon fhoráil sa dlí a cheadaíonn é ach oiread

source: Essentially, this is an issue of contract law - that is, the contract of employment signed and agreed between the employer and employee
ga: Is éard atá anseo go bunúsach ná ceist dlí conarthaí - is é sin le rá, conradh fostaíochta sínithe agus comhaontaithe idir an fostóir agus an fostaí

source: If you have any concerns about this issue, you are strongly advised to seek legal advice from a competent legal professional in advance of signing this contract
ga: Moltar duit go tréan comhairle dlí a fháil ó ghairmí inniúil sula síníonn tú conradh den sórt seo má tá imní ar bith ort faoin scéal

source: However, even if the contract is signed, you are always free to seek such legal advice
ga: Féadfaidh tú comhairle dlí a fháil fiú má tá an conradh sínithe agat

source: Solicitors' fees can vary widely so shop around and obtain some quotes for legal advice before you proceed
ga: Is minic a bhíonn an-difríocht ann idir na táillí a éilíonn aturnaetha éagsúla agus moltar duit roinnt siopadóireachta a dhéanamh agus luachanna maidir le comhairle dlí a fháil ar dtús

source: The contract can include a probationary period and can allow for this period to be extended
ga: Is féidir le tréimhse tástála a bheith san áireamh sa chonradh agus is féidir síneadh ama a chur leí

source: The Unfair Dismissals Acts 1997–2007 will not apply to the dismissal of an employee during a period at the beginning of employment when he/she is on probation or undergoing training provided that:
ga: Ní fheidhmíonn na hAchtanna um Dhífhostú Éagórach 1977-2007 do dhífhostú fostaithe i rith tréimhse ag tús na fostaíochta nuair atá sé/sí faoi thástáil nó faoi oiliúnt má:

source: • The contract of employment is in writing
ga: • tá an conradh fostaíochta i scríbhinn

source: • The duration of probation or training is one year or less and is specified in the contract
ga: • is tréimhse bliana nó níos lú í an tréimhse tástála nó oiliúna agus í luaite sa chonradh

source: The above exclusion from the Acts will not apply if the dismissal results from trade union membership or activity, pregnancy-related matters, or entitlements under the maternity protection, parental leave, adoptive leave and carer's leave legislation
ga: Níl feidhm ag an eisiamh thuas ó na hAchtanna má bhaineann an dífhostú le ballraíocht ceardchumainn nó gníomhaíocht ceardchumainn, nithe a bhaineann le bheith torrach nó cearta faoi na hAchtanna a bhaineann le cosaint mháithreachais, saoire do thuismitheoirí, saoire uchtaíoch, nó saoire cúramóra

source: Changes to your contract of employment
ga: Athruithe ar do chonradh fostaíochta

source: Changes to your contract of employment can occur due to a change in the law, but otherwise, changes must be agreed between your employer and yourself
ga: Féadann athruithe ar do chonradh fostaíochta a tharlú mar gheall ar athrú dlí, ach lasmuigh de sin, ní féidir aon athrú a dhéanamh gan comhaontú idir tú féin agus d’fhostóir

source: The requirement for both the employer's and the employee's consent to changes in the terms of the contract is part of contract law
ga: Ní féidir le ceachtar páirtí an conradh a athrú go haontaobhach

source: You can find out more about your employment rights in this explanatory booklet on the Terms of Employment (Information) Acts (pdf) or from Workplace Relations Commission's Information and Customer Services - see 'Where to apply' below
ga: Is féidir tuilleadh faoi do chearta fostaíochta sa leabhrán míniúcháin faoi na Achtanna um Théarmaí Fostaíochta (Faisnéis) (pdf) nó ón tSeirbhís Fhaisnéise agus Custaiméara an Choimisiúin um Chaidreamh san Áit Oibre a fháil – féach ‘Cá háit a ndéanfaidh mé iarratas’ thíos

source: Under the Acts, if your employer fails to give you written details of the terms of your employment within 2 months, you can bring a complaint using the online complaint form available on workplacerelations.ie
ga: Faoi na hAchtanna, má theipeann ar an fhostóir sonraí scríofa a thabhairt duit ar do chonradh fostaíochta, is féidir leat gearán a dhéanamh agus an fhoirm ghearáin ar líne a úsáid á fáil ar workplacerelations.ie

source: You must make the complaint within 6 months of the breach of the legislation occurring
ga: Caithfidh tú an gearán a dhéanamh taobh istigh de thréimhse 6 mhí ón tarlú sáraithe reachtaíochta

source: The time limit may be extended for up to a further 6 months, but only where there are reasonable circumstances which prevented the complaint being brought within the normal time limit. Where to apply Workplace Relations Commission Information and Customer Service O'Brien Road Carlow R93 W7W2 Ireland Opening Hours: Mon. to Fri
ga: Is féidir síneadh ama 6 mhí eile a thabhairt duit ach ní dhéanfar é sin mura bhfuil cúinsí réasúnacha ann a chuir cosc ort an gearán a dhéanamh laistigh den gnáth-thréimhse ama
